RIET/src/Documents/ServicesCostsAllocation/ServicesCostsAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ServicesCostsAllocation</name>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.DutiesRecharged</registerRecords>
  <registerRecords>AccumulationRegister.NotReceivedAgentInvoices</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Service</name>
      <type>
        <types>DocumentRef.Service</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/NotReceivedAgentInvoices/NotReceivedAgentInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>NotReceivedAgentInvoices</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Service</name>
    <type>
      <types>DocumentRef.Service</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/ServicesCostsAllocation/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзAgentInvoice" Тогда
			НастроитьДляВыбораИзAgentInvoice(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзAgentInvoice(СтруктураНастройки)
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("Agent", СтруктураНастройки.Agent);
	
	// Покажем только те Services costs allocations, по которым есть остатки
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Agent", СтруктураНастройки.Agent);
	Запрос.УстановитьПараметр("SoldTo", СтруктураНастройки.SoldTo);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ServicesCostsAllocationServices.Ссылка
		|ИЗ
		|	РегистрНакопления.NotReceivedAgentInvoices.Остатки(
		|			,
		|			SoldTo = &SoldTo
		|				И Service.Agent = &Agent) КАК NotReceivedAgentInvoicesОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ServicesCostsAllocation.Services КАК ServicesCostsAllocationServices
		|		ПО NotReceivedAgentInvoicesОстатки.Service = ServicesCostsAllocationServices.Service
		|			И (ServicesCostsAllocationServices.Ссылка.Проведен)";
	МассивServicesCostsAllocations = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Отбор.Вставить("Ссылка", МассивServicesCostsAllocations);
	
	Элементы.Список.МножественныйВыбор = Истина;
	
КонецПроцедуры
